In [10]:
import pandas as pd

In [11]:
df = pd.read_csv(r'C:\Users\Lenovo\OneDrive\Sample1.csv')

In [12]:
df.columns

Index(['S.No', 'Name', 'Gender', 'fname', 'lname', 'age'], dtype='object')

In [13]:
df.shape

(46, 6)

In [14]:
df.size

276

In [15]:
df.head()

   S.No                      Name  Gender   fname      lname  age
0     1            Aryan Bansode     Male   Aryan    Bansode  NaN
1     2      Vedika Paresh Pathak  Female  Vedika     Pathak  NaN
2     3         Bilwal Sonu Gokul  Female  Bilwal      Gokul  NaN
3     4  Bagade Sakshi Pandurang   Female  Bagade  Pandurang  NaN
4     5     Aditya Rajendra Wagh     Male  Aditya       Wagh  NaN

In [16]:
df.head(2)

   S.No                  Name  Gender   fname    lname  age
0     1        Aryan Bansode     Male   Aryan  Bansode  NaN
1     2  Vedika Paresh Pathak  Female  Vedika   Pathak  NaN

In [17]:
df.describe()

            S.No  age
count  46.000000  0.0
mean   24.217391  NaN
std    13.780684  NaN
min     1.000000  NaN
25%    12.250000  NaN
50%    24.500000  NaN
75%    35.750000  NaN
max    47.000000  NaN

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S.No    46 non-null     int64
 1   Name    46 non-null     object
 2   Gender  46 non-null     object
 3   fname   46 non-null     object
 4   lname   46 non-null     object
 5   age     0 non-null      float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.3+ KB

In [20]:
df2 = pd.read_csv(r'C:\Users\Lenovo\OneDrive\Book1.csv')
df2.head()

   name\tage\tvilage
0  Dhruv\t20\tmumbai
1  Dhruv\t20\tmumbai
2  Dhruv\t20\tmumbai
3  Dhruv\t20\tmumbai
4  Dhruv\t20\tmumbai